---
kind: type
id: T:Autodesk.Revit.DB.FabricationItemFile
source: html/ccf31061-ac40-f869-0b9e-834a9c146427.htm
---
# Autodesk.Revit.DB.FabricationItemFile

This class holds information about the item file, including whether it is already loaded from disk into Revit.

## Syntax (C#)
```csharp
public class FabricationItemFile : IDisposable
```

## Remarks
This object is created as a result of loading from disk.